---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs.IsSavingAsCentralFile
source: html/bfc922f3-95ca-5793-dfef-1b0253632291.htm
---
# Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs.IsSavingAsCentralFile Property

Indicates whether the document is to be saved as central file.

## Syntax (C#)
```csharp
public bool IsSavingAsCentralFile { get; }
```